MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MNHGBG/mcu.h
typedef struct st_ofsm {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDE : 3;
			unsigned long  : 1;
			unsigned long BANKMD : 3;
			unsigned long  : 25;
#else
			unsigned long  : 25;
			unsigned long BANKMD : 3;
			unsigned long  : 1;
			unsigned long MDE : 3;
#endif
	} BIT;
	} MDE;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long IWDTSTRT : 1;
			unsigned long IWDTTOPS : 2;
			unsigned long IWDTCKS : 4;
			unsigned long IWDTRPES : 2;
			unsigned long IWDTRPSS : 2;
			unsigned long IWDTRSTIRQS : 1;
			unsigned long  : 1;
			unsigned long IWDTSLCSTP : 1;
			unsigned long  : 2;
			unsigned long WDTSTRT : 1;
			unsigned long WDTTOPS : 2;
			unsigned long WDTCKS : 4;
			unsigned long WDTRPES : 2;
			unsigned long WDTRPSS : 2;
			unsigned long WDTRSTIRQS : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WDTRSTIRQS : 1;
			unsigned long WDTRPSS : 2;
			unsigned long WDTRPES : 2;
			unsigned long WDTCKS : 4;
			unsigned long WDTTOPS : 2;
			unsigned long WDTSTRT : 1;
			unsigned long  : 2;
			unsigned long IWDTSLCSTP : 1;
			unsigned long  : 1;
			unsigned long IWDTRSTIRQS : 1;
			unsigned long IWDTRPSS : 2;
			unsigned long IWDTRPES : 2;
			unsigned long IWDTCKS : 4;
			unsigned long IWDTTOPS : 2;
			unsigned long IWDTSTRT : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} OFS0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VDSEL : 2;
			unsigned long LVDAS : 1;
			unsigned long  : 5;
			unsigned long HOCOEN : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long HOCOEN : 1;
			unsigned long  : 5;
			unsigned long LVDAS : 1;
			unsigned long VDSEL : 2;
#endif
	} BIT;
	} OFS1;
	char           wk0[4];
	unsigned long  TMINF;
	char           wk1[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BANKSWP : 3;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long BANKSWP : 3;
#endif
	} BIT;
	} BANKSEL;
	char           wk2[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 27;
			unsigned long SPE : 1;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long SPE : 1;
			unsigned long  : 27;
#endif
	} BIT;
	} SPCC;
	char           wk3[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 24;
			unsigned long TMEF : 3;
			unsigned long  : 1;
			unsigned long TMEFDB : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long TMEFDB : 3;
			unsigned long  : 1;
			unsigned long TMEF : 3;
			unsigned long  : 24;
#endif
	} BIT;
	} TMEF;
	char           wk4[4];
	union {
		struct {
			unsigned long ID4:8;
			unsigned long ID3:8;
			unsigned long ID2:8;
			unsigned long ID1:8;
			unsigned long ID8:8;
			unsigned long ID7:8;
			unsigned long ID6:8;
			unsigned long ID5:8;
			unsigned long ID12:8;
			unsigned long ID11:8;
			unsigned long ID10:8;
			unsigned long ID9:8;
			unsigned long ID16:8;
			unsigned long ID15:8;
			unsigned long ID14:8;
			unsigned long ID13:8;
		} BIT;
	} OSIS;
	char           wk5[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FAWS : 12;
			unsigned long  : 3;
			unsigned long FSPR : 1;
			unsigned long FAWE : 12;
			unsigned long  : 3;
			unsigned long BTFLG : 1;
#else
			unsigned long BTFLG : 1;
			unsigned long  : 3;
			unsigned long FAWE : 12;
			unsigned long FSPR : 1;
			unsigned long  : 3;
			unsigned long FAWS : 12;
#endif
	} BIT;
	} FAW;
	char           wk6[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CODE : 32;
#else
			unsigned long CODE : 32;
#endif
	} BIT;
	} ROMCODE;
} st_ofsm_t;

typedef struct st_pdc {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PCKE : 1;
			unsigned long VPS : 1;
			unsigned long HPS : 1;
			unsigned long PRST : 1;
			unsigned long DFIE : 1;
			unsigned long FEIE : 1;
			unsigned long OVIE : 1;
			unsigned long UDRIE : 1;
			unsigned long VERIE : 1;
			unsigned long HERIE : 1;
			unsigned long PCKOE : 1;
			unsigned long PCKDIV : 3;
			unsigned long EDS : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long EDS : 1;
			unsigned long PCKDIV : 3;
			unsigned long PCKOE : 1;
			unsigned long HERIE : 1;
			unsigned long VERIE : 1;
			unsigned long UDRIE : 1;
			unsigned long OVIE : 1;
			unsigned long FEIE : 1;
			unsigned long DFIE : 1;
			unsigned long PRST : 1;
			unsigned long HPS : 1;
			unsigned long VPS : 1;
			unsigned long PCKE : 1;
#endif
	} BIT;
	} PCCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PCE : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long PCE : 1;
#endif
	} BIT;
	} PCCR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FBSY : 1;
			unsigned long FEMPF : 1;
			unsigned long FEF : 1;
			unsigned long OVRF : 1;
			unsigned long UDRF : 1;
			unsigned long VERF : 1;
			unsigned long HERF : 1;
			unsigned long  : 25;
#else
			unsigned long  : 25;
			unsigned long HERF : 1;
			unsigned long VERF : 1;
			unsigned long UDRF : 1;
			unsigned long OVRF : 1;
			unsigned long FEF : 1;
			unsigned long FEMPF : 1;
			unsigned long FBSY : 1;
#endif
	} BIT;
	} PCSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VSYNC : 1;
			unsigned long HSYNC : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long HSYNC : 1;
			unsigned long VSYNC : 1;
#endif
	} BIT;
	} PCMONR;
	union {
		unsigned long LONG;
	} PCDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VST : 12;
			unsigned long  : 4;
			unsigned long VSZ : 12;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long VSZ : 12;
			unsigned long  : 4;
			unsigned long VST : 12;
#endif
	} BIT;
	} VCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long HST : 12;
			unsigned long  : 4;
			unsigned long HSZ : 12;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long HSZ : 12;
			unsigned long  : 4;
			unsigned long HST : 12;
#endif
	} BIT;
	} HCR;
} st_pdc_t;

typedef struct st_pmgi {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long PSMCS : 6;
			unsigned long  : 1;
			unsigned long PSMDP : 1;
			unsigned long PSMHT : 3;
			unsigned long  : 1;
			unsigned long PSMCT : 3;
			unsigned long  : 9;
#else
			unsigned long  : 9;
			unsigned long PSMCT : 3;
			unsigned long  : 1;
			unsigned long PSMHT : 3;
			unsigned long PSMDP : 1;
			unsigned long  : 1;
			unsigned long PSMCS : 6;
			unsigned long  : 8;
#endif
	} BIT;
	} PMGCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PSME : 1;
			unsigned long PSMAD : 1;
			unsigned long  : 1;
			unsigned long PDA : 5;
			unsigned long PRA : 5;
			unsigned long  : 3;
			unsigned long PRD : 16;
#else
			unsigned long PRD : 16;
			unsigned long  : 3;
			unsigned long PRA : 5;
			unsigned long PDA : 5;
			unsigned long  : 1;
			unsigned long PSMAD : 1;
			unsigned long PSME : 1;
#endif
	} BIT;
	} PSMR;
} st_pmgi_t;

typedef struct st_poe {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE0M : 2;
			unsigned short  : 6;
			unsigned short PIE1 : 1;
			unsigned short  : 3;
			unsigned short POE0F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE0F : 1;
			unsigned short  : 3;
			unsigned short PIE1 : 1;
			unsigned short  : 6;
			unsigned short POE0M : 2;
#endif
	} BIT;
	} ICSR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE1 : 1;
			unsigned short OCE1 : 1;
			unsigned short  : 5;
			unsigned short OSF1 : 1;
#else
			unsigned short OSF1 : 1;
			unsigned short  : 5;
			unsigned short OCE1 : 1;
			unsigned short OIE1 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE4M : 2;
			unsigned short  : 6;
			unsigned short PIE2 : 1;
			unsigned short  : 3;
			unsigned short POE4F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE4F : 1;
			unsigned short  : 3;
			unsigned short PIE2 : 1;
			unsigned short  : 6;
			unsigned short POE4M : 2;
#endif
	} BIT;
	} ICSR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE2 : 1;
			unsigned short OCE2 : 1;
			unsigned short  : 5;
			unsigned short OSF2 : 1;
#else
			unsigned short OSF2 : 1;
			unsigned short  : 5;
			unsigned short OCE2 : 1;
			unsigned short OIE2 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE8M : 2;
			unsigned short  : 6;
			unsigned short PIE3 : 1;
			unsigned short POE8E : 1;
			unsigned short  : 2;
			unsigned short POE8F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE8F : 1;
			unsigned short  : 2;
			unsigned short POE8E : 1;
			unsigned short PIE3 : 1;
			unsigned short  : 6;
			unsigned short POE8M : 2;
#endif
	} BIT;
	} ICSR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MTUCH34HIZ : 1;
			unsigned char MTUCH67HIZ : 1;
			unsigned char MTUCH0HIZ : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char MTUCH0HIZ : 1;
			unsigned char MTUCH67HIZ : 1;
			unsigned char MTUCH34HIZ : 1;
#endif
	} BIT;
	} SPOER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MTU0AZE : 1;
			unsigned char MTU0BZE : 1;
			unsigned char MTU0CZE : 1;
			unsigned char MTU0DZE : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char MTU0DZE : 1;
			unsigned char MTU0CZE : 1;
			unsigned char MTU0BZE : 1;
			unsigned char MTU0AZE : 1;
#endif
	} BIT;
	} POECR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTU7BDZE : 1;
			unsigned short MTU7ACZE : 1;
			unsigned short MTU6BDZE : 1;
			unsigned short  : 5;
			unsigned short MTU4BDZE : 1;
			unsigned short MTU4ACZE : 1;
			unsigned short MTU3BDZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short MTU3BDZE : 1;
			unsigned short MTU4ACZE : 1;
			unsigned short MTU4BDZE : 1;
			unsigned short  : 5;
			unsigned short MTU6BDZE : 1;
			unsigned short MTU7ACZE : 1;
			unsigned short MTU7BDZE : 1;
#endif
	} BIT;
	} POECR2;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 2;
			unsigned short IC2ADDMT34ZE : 1;
			unsigned short IC3ADDMT34ZE : 1;
			unsigned short IC4ADDMT34ZE : 1;
			unsigned short IC5ADDMT34ZE : 1;
			unsigned short  : 3;
			unsigned short IC1ADDMT67ZE : 1;
			unsigned short  : 1;
			unsigned short IC3ADDMT67ZE : 1;
			unsigned short IC4ADDMT67ZE : 1;
			unsigned short IC5ADDMT67ZE : 1;
			unsigned short  : 2;
#else
			unsigned short  : 2;
			unsigned short IC5ADDMT67ZE : 1;
			unsigned short IC4ADDMT67ZE : 1;
			unsigned short IC3ADDMT67ZE : 1;
			unsigned short  : 1;
			unsigned short IC1ADDMT67ZE : 1;
			unsigned short  : 3;
			unsigned short IC5ADDMT34ZE : 1;
			unsigned short IC4ADDMT34ZE : 1;
			unsigned short IC3ADDMT34ZE : 1;
			unsigned short IC2ADDMT34ZE : 1;
			unsigned short  : 2;
#endif
	} BIT;
	} POECR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 1;
			unsigned short IC1ADDMT0ZE : 1;
			unsigned short IC2ADDMT0ZE : 1;
			unsigned short  : 1;
			unsigned short IC4ADDMT0ZE : 1;
			unsigned short IC5ADDMT0ZE : 1;
			unsigned short  : 10;
#else
			unsigned short  : 10;
			unsigned short IC5ADDMT0ZE : 1;
			unsigned short IC4ADDMT0ZE : 1;
			unsigned short  : 1;
			unsigned short IC2ADDMT0ZE : 1;
			unsigned short IC1ADDMT0ZE : 1;
			unsigned short  : 1;
#endif
	} BIT;
	} POECR5;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE10M : 2;
			unsigned short  : 6;
			unsigned short PIE4 : 1;
			unsigned short POE10E : 1;
			unsigned short  : 2;
			unsigned short POE10F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE10F : 1;
			unsigned short  : 2;
			unsigned short POE10E : 1;
			unsigned short PIE4 : 1;
			unsigned short  : 6;
			unsigned short POE10M : 2;
#endif
	} BIT;
	} ICSR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE11M : 2;
			unsigned short  : 6;
			unsigned short PIE5 : 1;
			unsigned short POE11E : 1;
			unsigned short  : 2;
			unsigned short POE11F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE11F : 1;
			unsigned short  : 2;
			unsigned short POE11E : 1;
			unsigned short PIE5 : 1;
			unsigned short  : 6;
			unsigned short POE11M : 2;
#endif
	} BIT;
	} ICSR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 9;
			unsigned short OSTSTE : 1;
			unsigned short  : 2;
			unsigned short OSTSTF : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short OSTSTF : 1;
			unsigned short  : 2;
			unsigned short OSTSTE : 1;
			unsigned short  : 9;
#endif
	} BIT;
	} ICSR6;
	char           wk2[6];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0ASEL : 4;
			unsigned char M0BSEL : 4;
#else
			unsigned char M0BSEL : 4;
			unsigned char M0ASEL : 4;
#endif
	} BIT;
	} M0SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0CSEL : 4;
			unsigned char M0DSEL : 4;
#else
			unsigned char M0DSEL : 4;
			unsigned char M0CSEL : 4;
#endif
	} BIT;
	} M0SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M3BSEL : 4;
			unsigned char M3DSEL : 4;
#else
			unsigned char M3DSEL : 4;
			unsigned char M3BSEL : 4;
#endif
	} BIT;
	} M3SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4ASEL : 4;
			unsigned char M4CSEL : 4;
#else
			unsigned char M4CSEL : 4;
			unsigned char M4ASEL : 4;
#endif
	} BIT;
	} M4SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4BSEL : 4;
			unsigned char M4DSEL : 4;
#else
			unsigned char M4DSEL : 4;
			unsigned char M4BSEL : 4;
#endif
	} BIT;
	} M4SELR2;
	char           wk3[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M6BSEL : 4;
			unsigned char M6DSEL : 4;
#else
			unsigned char M6DSEL : 4;
			unsigned char M6BSEL : 4;
#endif
	} BIT;
	} M6SELR;
} st_poe_t;

typedef struct st_poeg {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 9;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 9;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGA;
	char           wk0[252];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 9;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 9;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGB;
	char           wk1[252];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 9;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 9;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGC;
	char           wk2[252];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 9;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 9;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGD;
} st_poeg_t;

typedef struct st_port0 {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PODR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PIDR;
	char           wk2[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PMR;
	char           wk3[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char  : 1;
			unsigned char B2 : 1;
			unsigned char  : 1;
			unsigned char B4 : 1;
			unsigned char  : 1;
			unsigned char B6 : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char B6 : 1;
			unsigned char  : 1;
			unsigned char B4 : 1;
			unsigned char  : 1;
			unsigned char B2 : 1;
			unsigned char  : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} ODR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 2;
			unsigned char B2 : 1;
			unsigned char  : 3;
			unsigned char B6 : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char B6 : 1;
			unsigned char  : 3;
			unsigned char B2 : 1;
			unsigned char  : 2;
#endif
	} BIT;
	} ODR1;
	char           wk4[62];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char  : 1;
			unsigned char B5 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PCR;
	char           wk5[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} DSCR;
	char           wk6[71];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} DSCR2;
} st_port0_t;

typedef struct st_port1 {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
